name: "VGG_ILSVRC_16_layer"
layer {
  name: "data"
  type: "Data"
  include {
    phase: TRAIN
  }
 transform_param {
    crop_size: 224
    mean_file: "../full_mammo_dataset/mass_50_train_mean.binaryproto"
    mirror: true
 }
 data_param {
    source: "../../../mnt/2x_augmented_train_lmdb"
    batch_size: 64
    backend: LMDB
  }
  top: "data"
  top: "label"
}
layer {
  name: "data"
  type: "Data"
  include {
    phase: TEST
  }
 transform_param {
    crop_size: 224
    mean_file: "../full_mammo_dataset/mass_50_train_mean.binaryproto"
    mirror: false
 }
 data_param {
    source: "../full_mammo_dataset/mass_50_padding_dataset_val_lmdb"
    batch_size: 8
    backend: LMDB
  }
  top: "data"
  top: "label"
}
layer {
  bottom: "data"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}
layer {
  bottom: "conv5_3"
  top: "pool5"
  name: "pool5"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool5"
  top: "dm-fc6"
  name: "dm-fc6"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
  param { lr_mult: 0.1 decay_mult: 1 }
  param { lr_mult: 0.1 decay_mult: 1 }
}
layer {
  bottom: "dm-fc6"
  top: "dm-fc6"
  name: "relu6"
  type: "ReLU"
}
layer {
  bottom: "dm-fc6"
  top: "dm-fc6"
  name: "drop6"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.25
  }
}
layer {
  bottom: "dm-fc6"
  top: "dm-fc7"
  name: "dm-fc7"
  type: "InnerProduct"
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
  }
}
layer {
  bottom: "dm-fc7"
  top: "dm-fc7"
  name: "dm-relu7"
  type: "ReLU"
}
layer {
  bottom: "dm-fc7"
  top: "dm-fc7"
  name: "dm-drop7"
  type: "Dropout"
  dropout_param {
    dropout_ratio: 0.25
  }
}
layer {
  name: "dm-fc8"
  bottom: "dm-fc7"
  top: "dm-fc8"
  type: "InnerProduct"
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "dm-fc8"
  bottom: "label"
  top: "loss"
}
layer {
  name: "acc"
  type: ACCURACY
  bottom: "dm-fc8"
  bottom: "label"
  top: "acc"
  accuracy_param {
    top_k: 1
  }
}
